{
    "1857950": "A.K Gopalan v. State Of Madras .",
    "363089": "Ananda Bazar Patrika (P) Ltd. v. Workmen",
    "128161": "Atiabari Tea Co., Ltd. v. State Of Assam And Others (And Connected Petition And Appeals) .",
    "307021": "Bachan Singh v. State Of Punjab",
    "4354": "Chiranjit Lal Chowdhuri v. Union Of India And Others",
    "1237504": "Commissioner Of Customs, Calcutta v. G.C Jain And Another",
    "1902038": "Express Newspaper (P) Ltd. v. Union Of India",
    "1486034": "Haradhan Saha Petitioner: v. State Of West Bengal And Others",
    "257876": "His Holiness Kesavananda Bharati Sripadagalvaru v. State Of Kerala And Another",
    "1105134": "John Martin v. State Of West Bengal",
    "688031": "Kamleshkumar Ishwardas Patel v. Union Of India And Others",
    "1813801": "Kartar Singh v. State Of Punjab .",
    "619152": "Kharak Singh v. State Of U.P And Others",
    "1766147": "Maneka Gandhi v. Union Of India And Another",
    "1326478": "Ramakrishna Cement (The K.C.P Ltd.) v. Industrial Tribunal, A.P And Another",
    "151609698": "Rekha v. State Of Tamil Nadu Through Secretary To Government And Anothe",
    "456839": "Romesh Thappar v. State Of Madras",
    "513801": "Rustom Cavasjee Cooper v. Union Of India",
    "1633179": "S. Gopalan v. State Of Madras",
    "243002": "Sakal Papers (P) Ltd. v. Union Of India",
    "1747577": "Satwant Singh Sawhney v. D. Ramarathnam, Assistant Passport Officer, New Delhi And Others",
    "885778": "Sheth Maneklal Mansukhbhai v. Hormusji Jamshedji Ginwalla And Sons",
    "1732220": "State Of A.P And Others / v. Mcdowell & Co. And Others",
    "334293": "State Of Bombay And Another v. F.N Balsara",
    "1334665": "State Of Travancore-Cochin And Others v. Bombay Company Ltd., Alleppey",
    "184660633": "State Of West Bengal v. Anwar Ali Sarkar",
    "973363": "State Of West Bengal v. Subodh Gopal Bose And Others",
    "1106747": "Acc Limited v. State Of Kerala .",
    "150814946": "Arasmeta Captive Power Company Private Limited And Another v. Lafarge India Private Limited .",
    "1767393": "Bank Of India And Another v. K. Mohandas And Others",
    "681866": "Deepak Bajaj v. State Of Maharashtra And Another",
    "1521407": "Kalyan Chandra Sarkar v. Rajesh Ranjan Alias Pappu Yadav And Another",
    "104313664": "Rural Litigation And Entitlement Kendra v. State Of U.P .",
    "1735815": "Adm, Jabalpur v. Shivakant Shukla",
    "875590": "A.K Roy v. Union Of India And Others",
    "936707": "Indira Nehru Gandhi v. Raj Narain",
    "657557": "Kalabharati Advertising v. Hemant Vimalnath Narichania And Ors. S",
    "1939993": "Minerva Mills Ltd. And Others v. Union Of India And Others",
    "112850760": "S.P Gupta v. Union Of India And Another",
    "629330": "Smt S.R Venkataraman v. Union Of India And Another",
    "1656601": "State Of Orissa v. Sudhansu Sekhar Misra And Others ,",
    "1134697": "Union Of India And Another v. Tulsiram Pa Tel .",
    "1799441": "Union Of India Through Govt. Of Pondicherry And Another v. V. Ramakrishnan And Others",
    "130470": "Ajay Mitra v. State Of M.P And Others",
    "450219": "Chunduru Siva Ram Krishna And Another v. Peddi Ravindra Babu And Another",
    "169522737": "G.V Rao v. L.H.V Prasad And Others",
    "83406": "Ganesh Narayan Hegde v. S. Bangarappa And Others",
    "8919089": "Hridaya Ranjan Prasad Verma And Others v. State Of Bihar And Another",
    "39679": "Indian Oil Corpn. v. Nepc India Ltd. And Others",
    "1830927": "Janata Dal v. H.S Chowdhary And Others",
    "10239019": "Lalmuni Devi (Smt) v. State Of Bihar And Others",
    "230062": "M. Krishnan v. Vijay Singh And Another",
    "1738333": "Madhavrao Jiwajirao Scindia And Others v. Sambhajirao Chandrojirao Angre And Others",
    "511635": "Medchl Chemicals & Pharma (P) Ltd. v. Biological E. Ltd. And Others",
    "574884": "Pepsi Foods Ltd. And Another v. Special Judicial Magistrate And Others",
    "579822": "Rupan Deol Bajaj (Mrs) And Another v. Kanwar Pal Singh Gill And Another",
    "1960340": "S.M Datta v. State Of Gujarat And Another",
    "891864": "S.W Palanitkar And Others v. State Of Bihar And Another",
    "437533": "Shakson Belthissor v. State Of Kerala And Another",
    "996328": "Sheonandan Paswan v. State Of Bihar And Others",
    "1287305": "State Of Bihar And Another v. P.P Sharma, Ias And Another",
    "1033637": "State Of Haryana And Others v. Bhajan Lal And Others",
    "1926500": "State Of West Bengal And Others v. Swapan Kumar Guha And Others",
    "838466": "V.V.S Rama Sharma And Others v. State Of Uttar Pradesh And Others",
    "1956673": "V.Y Jose And Another v. State Of Gujarat And Another",
    "279427": "Zandu Pharmaceutical Works Ltd. And Others v. Mohd. Sharaful Haque And Another",
    "103561": "American Home Products Corporation v. Mac Laboratories Pvt. Ltd. And Another",
    "1928398": "Avis Internatioanal Ltd. v. Avi Footwear Industries",
    "1114158": "Cadila Health Care Ltd. v. Cadila Pharmaceuticals Ltd. .",
    "1181080": "Century Traders v. Roshan Lal Duggar & Co",
    "1615016": "Durga Dutt Sarma v. Navaratna Pharmaceutical Laboratories",
    "614998": "Girdhari Lal And Sons v. Balbir Nath Mathur And Others",
    "104935066": "Gujarat Bottling Co. Ltd. And Others v. Coca Cola Co. And Others",
    "1874558": "Hardie Trading Ltd. And Another v. Addisons Paint & Chemicals Ltd. .",
    "280042": "K. R. Chinna Krishna Chettiar v. Shri Ambal And Co., Madras And Another",
    "730804": "Life Insurance Corporation Of India v. Escorts Ltd. And Others",
    "483899": "M. Pentiah And Others v. Muddala Veeramallappa And Others",
    "1418391": "M/S J.K Cotton Spinning And Weaving Mills Ltd. And Another v. Union Of India And Others",
    "1732339": "N.R Dongre & Ors. v. Whirlpool Corp. & Anr",
    "1938862": "National Bell Co. v. Metal Goods Mfg. Co. (P) Ltd.",
    "391843": "Parayankandiyal Eravath Kanapravan Kalliani Amma (Smt) And Others v. K. Devi And Others",
    "858066": "Ramdev Food Products (P) Ltd. v. Arvindbhai Rambhai Patel And Others",
    "936398": "State Of Madhya Pradesh v. Azad Bharat Finance Co. And Another .",
    "1643349": "Union Of India . v. Kamal Kumar Goswami And Others",
    "143917974": "Vaiso Jain v. Ndmc",
    "1747781": "Vishnudas Trading As Vishnudas Kishendas v. Vazir Sultan Tobacco Co. Ltd., Hyderabad And Another",
    "70463837": "Vyapari Kalyan Mandal Main Pushpa & Anr. Petitioners v. South Delhi Municipal Corporation & Ors. S",
    "172383107": "Whirlpool Corporation v. Registrar Of Trade Marks, Mumbai And Others",
    "368264": "Amritdhara Pharmacy v. Satya Deo Gupta .",
    "67255": "Anglo/Dutch, Colour & Varnish Works Private Ltd. v. India Trading House",
    "487303": "Astra-Idl Limited v. Ttk Pharma Limited",
    "1806604": "Automatic Electric Limited v. R.K. Dhawan",
    "1883538": "Corn Products Refining Co. v. Shangrila Food Products Ltd .",
    "1389940": "F. Hoffmann-La Roche & Co. Ltd. v. Geoffrey Manners & Co. Pvt. Ltd. .",
    "315836": "Hindustan Pencils Private Limited v. India Stationary Products Co.",
    "529384": "Kaviraj Pandit Durga... v. Navaratna Pharmaceut...",
    "1299452": "Laxmikant V. Patel v. Chetanbhai Shah And Another",
    "415294": "M/S Atlas Cycle Industries Ltd. v. Hind Cycles Limited",
    "1965879": "M/S Power Control Appliances And Others v. Sumeet Machines Pvt. Ltd. .",
    "1555192": "Mahendra & Mahendra Paper Mills Ltd. v. Mahindra & Mahindra Ltd. .",
    "151308629": "Ms.Heinz Italia & Anr v. Ms.Dabur India Ltd",
    "1233360": "National Sewing Thread Co. Ltd. v. James Chadwick And Bros, Ltd.",
    "880032": "Parle Products (P) Ltd. v. J.P And Co., Mysore .",
    "1300681": "Ruston & Hornsby Ltd. v. Zamindara Engineering Co. .",
    "44410582": "S.M Dyechem Ltd. v. Cadbury (India) Ltd. .",
    "145401736": "Amway India Enterprises Pvt. Ltd. vs 1Mg Technologies Pvt. Ltd. & Anr. on 8 July, 2019",
    "14377547": "CLOUDTAIL INDIA PRIVATE LIMITED v. AMWAY INDIA ENTERPRISES PRIVATE LIMITED ORS",
    "43335747": "AMAZON SELLER SERVICES PVT LTD v. MODICARE LTD ORS",
    "192914986": "AMAZON SELLER SERVICES PVT LTD v. ORIFLAME INDIA PVT LTD ORS",
    "99622088": "Christian Louboutin Sas v. Nakul Bajaj",
    "167333165": "Luxottica Group S.P.A. v. Mify Solutions Pvt. Ltd.",
    "617728": "Anjaleem Enterprises (P) Ltd. v. Commissioner Of Central Excise, Ahmedabad .",
    "952963": "Associated Cement Companies Ltd. v. Commissioner Of Customs .",
    "248715": "Commissioner Of Central Excise, Belgaum v. Akay Cosmetics (P) Ltd.",
    "178445": "Commissioner Of Central Excise, Pondicherry v. Acer India Ltd. .",
    "65151197": "Commissioner Of Customs, Chennai v. Hewlett Packard India Sales (P) Ltd. .",
    "1725672": "Commissioner Of Income Tax v. P.V.A.L Kulandagan Chettiar (Dead) Through Lrs. .",
    "1341895": "Commissioner Of Income Tax v. Vasavi Pratap Chand",
    "1165503": "Commissioner Of Income Tax, West Bengal v. Wesman Engineering Co. (P) Ltd. .",
    "91088": "Commissioner Of Income-Tax v. Tata Engineering And Locomotive Co. Ltd.",
    "1911637": "Commissioner Of Income-Tax/Andhra Pradesh-Iii v. Superintending Engineer, Upper Sileru",
    "105936170": "Jaswal Neco Limited v. Commissioner Of Customs, Visakhapatnam .",
    "962370": "M S Weston Components Ltd v. Commissioner Of Customs New Delhi",
    "1414629": "Psi Data Systems Ltd. v. Collector Of Central Excise .",
    "446174": "Sprint Rpg India Ltd. v. Commissioner Of Customs-I, Delhi .",
    "1130742": "State Of Karnataka And Others v. C. Lalitha .",
    "39169380": "Tata Consultancy Services v. State Of A.P .",
    "26718353": "Tdi Fun Republic Shop Owner Welfare Association v. E-City Property Management & Services Pvt. Ltd.",
    "1960330": "Union Of India And Another v. Azadi Bachao Andolan And Another",
    "1328814": "Aphali Pharmaceuticals Ltd. v. State Of Maharashtra And Others",
    "1350547": "A.V Fernandez v. State Of Kerala .",
    "665756": "Academy Of Nutrition Improvement And Others v. Union Of India .",
    "350457": "Aswini Kumar Ghose & Another v. Arabinda Bose And Another",
    "968805": "Baidyanath Ayurved Bhawan (Pvt) Ltd., Jhansi v. Excise Commissioner, U.P And Others",
    "590022": "Banarsi Debi v. Ito",
    "1629830": "Bengal Immunity Company Limited v. State Of Bihar And Others",
    "187706": "Bihta Cooperative Development Cane Marketing Union Ltd., And Another v. Bank Of Bihar & Others .",
    "1741822": "Chairman, Sebi v. Shriram Mutual Fund And Another",
    "386457": "Cit v. V. Mr. P. Firm Muar",
    "821579": "Commissioner Of Income Tax, Patiala & Others v. Shahzada Nand & Sons & Others .",
    "850597": "Commissioner Of Sales Tax, U.P v. Modi Sugar Mills Ltd. .",
    "1326572": "Controller Of Estate Duty, Gujarat v. Shri Kantilal Trikamlal .",
    "762574": "Goodyear India Ltd. And Others v. State Of Haryana And Another",
    "784749": "Gursahai Saigal (In All The Appeals). v. Commissioner Of Income Tax, Punjab(In All The Appeals).",
    "399708": "K.P Varghese v. Income Tax Officer, Ernakulam And Another",
    "1120277": "Kerala Samsthana Chethu Thozhilali Union v. State Of Kerala And Others",
    "1291316": "M.P.V. Sundararamier & Co. v. State Of A.P.",
    "1231997": "Oswal Agro Mills Ltd. And Others v. Collector Of Central Excise And Others",
    "292442": "Shrimati Tarulata Shyam And Others v. Commissioner Of Income Tax, West Bengal .",
    "424874": "State Of Bombay And Another v. United Motors (India) Ltd. & Others",
    "691481": "State Of Karnataka And Another v. H. Ganesh Kamath And Others",
    "1308350": "State Of Kerala And Others v. Unni And Another",
    "1425329": "State Of Madras v. Gannon Dunkerley & Co., (Madras) Ltd.",
    "1869992": "Sutlej Cotton Mills Ltd. v. Commissioner Of Income Tax, West Bengal-Iii, Calcutta .",
    "64332": "Swedish Match Ab And Another v. Securities & Exchange Board Of India And Another",
    "1482259": "Ujagar Prints And Others (Ii) v. Union Of India And Others",
    "126699": "Aristo Pharmaceuticals Ltd. v. Wockhardt Ltd. .",
    "74028": "Hindustan Petroleum Corpn. Ltd. v. Sriman Narayan And Another",
    "2044127": "J.R Kapoor v. Micronix India .",
    "1951505": "Seema Arshad Zaheer And Others v. Municipal Corpn. Of Greater Mumbai And Others",
    "330608": "Wander Ltd. And Another v. Antox India P. Ltd. .",
    "810279": "Abdulgafar A. Nadiadwala v. Assistant Commissioner Of Income-Tax And Others",
    "6544121": "Bharat Sanchar Nigam Ltd. And Another v. Union Of India And Others",
    "1240131": "Commissioner Of Customs (Preventive), Mumbai v. M. Ambalal And Company .",
    "939624": "Union Of India v. Ahmedabad Electricity Co. Ltd. And Others",
    "104312764": "Uniworth Textiles Limited v. Commissioner Of Central Excise, Raipur .",
    "1514111": "Astra Pharmaceuticals (P) Ltd. v. Collector Of Central Excise, Chandigarh",
    "96932": "Assistant Collector Of Central Excise, Chandan Nagar, West Bengal / v. Dunlop India Ltd. And Others",
    "477104": "B.H.E.L Ancillary Association v. Collector Of C. Ex.",
    "1537954": "Balwant Narayan Bhagde v. M.D Bhagwat And Others",
    "263884": "Commissioner Of Central Excise, Chandigarh-I v. Mahaan Dairies .",
    "992249": "Commissioner Of Central Excise, Hyderabad v. Sarat Electronics",
    "1098305": "Commissioner Of Central Excise, Mumbai v. Kalvert Foods India Private Limited And Others",
    "467194": "Commissioner Of Central Excise, Trichy v. Grasim Industries Ltd. .",
    "910213": "Commissioner Of Central Excise, Trichy v. Rukmani Pakkwell Traders .",
    "199977": "Cosmic Dye Chemical v. Collector Of Central Excise, Bombay .",
    "712132": "Lark Laboratories Ltd. v. Nabros Pharma Pvt. Ltd.",
    "292146": "Milmet Oftho Industries v. Collector of C. Ex., Baroda",
    "1375132": "P. Chinnanna And Others v. State Of A.P And Others",
    "678038": "Padmini Products v. Collector Of Central Excise, Bangalore .",
    "1073828": "Pushpam Pharmaceuticals Company v. Collector Of Central Excise, Bombay .",
    "37963": "Rajasthan Housing Board And Others v. Shri Kishan And Others",
    "615459": "S.B.L Limited v. The Himalaya Drug Co.",
    "1295746": "Senjeevanagar Medica... v. Mohd. Abdul Wahab An...",
    "1528386": "Balram Singh v. Bhikam Chand Jain And Others",
    "458739": "Babu Ram Gupta v. Sudhir Bhasin And Another",
    "1097981": "Bank Of Baroda v. Sadruddin Hasan Daya And Another",
    "844819": "Dwarka Nath v. Income Tax Officer, Special Circle, D Ward, Kanpur",
    "1007946": "K.D Sharma v. Steel Authority Of India Limited And Others",
    "211970": "Mohd. Ikram Hussain ... v. State Of Uttar Prade...",
    "1668551": "Noorali Babul Thanewala v. K.M.M Shetty And Others",
    "1401520": "Pritam Pal v. High Court Of Madhya Pradesh, Jabalpur Through Registrar .",
    "1281050": "Ramana Dayaram Shetty v. International Airport Authority Of India And Others",
    "134913": "Bengal Waterproof Limited v. Bombay Waterproof Manufacturing Company And Another",
    "5398766": "Alka Gupta v. Narender Kumar Gupta",
    "63283859": "Bapusaheb Chimasaheb... v. Mahesh Vijaysinha Ra...",
    "1053542": "D. Cawasji & Co. And Others v. State Of Mysore And Another",
    "1662395": "Deva Ram And Another v. Ishwar Chand And Another",
    "1407895": "Gurbux Singh v. Bhooralal",
    "614536": "Haldiram Bhujiawala And Another v. Anand Kumar Deepak Kumar And Another",
    "672966": "Indian Herbs Research And Supply Co. Ltd. v. Lalji Mal",
    "952975": "Kunjan Nair Sivaraman Nair v. Narayanan Nair And Others",
    "784265": "Midas Hygiene Industries (P) Ltd. And Another v. Sudhir Bhatia And Others",
    "18546": "S. Nazeer Ahmed v. State Bank Of Mysore And Others",
    "1292071": "State Of Madhya Pradesh And Others v. Yogendra Shrivastava",
    "1901943": "State Of Maharashtra And Another v. National Construction Company, Bombay And Another",
    "1967742": "T.V Venugopal v. Ushodaya Enterprises Limited And Another",
    "820931": "Union Of India v. Punnilal And Others",
    "444303": "V.E.A Annamalai Chettiar And Another v. S.V.V.S Veerappa Chettiar And Two Others",
    "353751": "Vallabh Das v. Dr Madan Lal And Other",
    "444914": "Bharat Glass Tube Limited v. Gopal Glass Works Limited .",
    "1766312": "Ampro Food Products v. Ashoka Biscuit Works",
    "168489488": "Apl Apollo Tubes Ltd. v. Surya Roshni Limited",
    "190196010": "Castrol India Ltd. v. Tide Water Oil Co. (I) Ltd.",
    "183984262": "Cello Household Products v. Modware India",
    "189337794": "Faber-Castell Aktiengesellschaft v. Cello Pens Pvt. Ltd.",
    "1543503": "Faber-Castell Aktiengesellschaft v. Pikpen Private Limited",
    "19267666": "Lupin Ltd. v. Johnson And Johnson",
    "819445": "M/S. B. Chawla And Sons v. M/S. Bright Auto Industries .",
    "759618": "Marico Ltd. v. Raj Oil Mills Ltd.",
    "112937069": "Microfibres Inc. v. Girdhar",
    "91635": "Ravinder Kumar Gupta v. Ravi Raj Gupta And Others",
    "3849421": "Reckitt Benkiser India Ltd. v. Wyeth Ltd.",
    "793618": "Rotela Auto Components (P) Ltd. v. Jaspal Singh",
    "164002734": "Rotomac Pens Ltd. v. Milap Chand & Co. .",
    "183717026": "Standard Corporation India Ltd. v. Tractors And Farm Equipment Ltd.",
    "99670896": "Steelbird Hi-Tech India Ltd. v. S.P.S. Gambhir",
    "1765871": "Bhaurao Dagdu Paralkar v. State Of Maharashtra And Others",
    "1154981": "A.V Papayya Sastry And Others v. Govt. Of A.P And Others",
    "756739": "Bank Of India And Another v. Avinash D. Mandivikar And Others",
    "1817694": "Behari Kunj Sahkari Avas Samiti v. State Of Uttar Pradesh And Others",
    "42355707": "Commissioner Of Customs (Preventive) v. Aafloat Textiles India Private Limited And Others",
    "894494": "Commissioner Of Customs, Kandla v. Essar Oil Ltd. And Others",
    "1035719": "Dr Vimla v. Delhi Administration .",
    "1425907": "Gowrishankar And Another v. Joshi Amba Shankar Family Trust And Others",
    "89564": "Indian Bank v. Satyam Fibres (India) Pvt. Ltd. .",
    "75646": "Kendriya Vidyalaya Sangathan And Others v. Ram Ratan Yadav .",
    "1329151": "Meghmala And Others v. G. Narasimha Reddy And Others",
    "1475926": "R. Vishwanatha Pillai v. State Of Kerala And Others",
    "805786": "Rajabhai Abdul Rehman Munshi v. Vasudev Dhanjibhai Mody .",
    "371933": "Ram Chandra Singh v. Savitri Devi And Others",
    "943008": "Ram Preeti Yadav v. U.P Board Of High School And Intermediate Education And Others",
    "623494": "Roshan Deen v. Preeti Lal .",
    "113963352": "S.P Chengalvaraya Naidu (Dead) By Lrs. v. Jagannath (Dead) By Lrs. And Others",
    "1697217": "Shrisht Dhawan (Smt) v. M/S Shaw Brothers",
    "1602137": "State Of A.P And Another v. T. Suryachandra Rao .",
    "1341112": "State Of Orissa And Others v. Harapriya Bisoi .",
    "713825": "United India Insurance Co. Ltd. v. Rajendra Singh And Others",
    "188348": "V. Balakrishna Reddiar v. Branch Manager, Lic Of India & Ors.",
    "435765": "Vijay Syal And Another v. State Of Punjab And Others",
    "955097": "Bhavnesh Mohanlal Amin And Another v. Nirma Chemicals Works Ltd. And Another",
    "1206795": "Bhavnesh Mohanlal Amin v. Nirma Chemical Works Ltd.",
    "611025": "M. Gurudas And Others v. Rasaranjan And Others",
    "1630167": "Satyam Infoway Ltd. v. Siffynet Solutions (P) Ltd. .",
    "1514512": "Skyline Education Institute (India) Private Limited v. S.L Vaswani And Another",
    "163696803": "Canara Bank v. N.G. Subbaraya Setty And Another",
    "1353689": "A.R Antulay v. R.S Nayak And Another",
    "28356393": "Alcon Electronics Private Limited v. Celem S.A Of Fos 34320 Roujan, France And Another",
    "1988625": "Dadu Dayalu Mahasabha, Jaipur (Trust) v. Mahant Ram Niwas And Another",
    "1737054": "Hope Plantations Ltd. v. Taluk Land Board, Peermade And Another",
    "1006709": "Mathura Prasad Bajoo Jaiswal And Others v. Dossibai N.B Jeejeebhoy",
    "82895350": "Messer Griesheim Gmbh Decree Holder v. Goyal Mg Gases Pvt. Ltd. Judgment Debtor.",
    "1714313": "Raj Krishanlal Marwah v. Govind H. Rohira",
    "938898": "Sri Gangai Vinayagar Temple And Another v. Meenakshi Ammal And Others",
    "1231223": "Commissioner Of Central Excise, Calcutta v. Emkay Investments (P) Ltd. And Another",
    "1213021": "Commissioner Of Central Excise, New Delhi v. Hari Chand Shri Gopal And Others",
    "222788": "Commissioner Of Central Excise, Raipur v. Hira Cement .",
    "102886851": "M/S. Ritzbury India (P) Ltd. v. Cce, Chennai",
    "1401567": "Rukmani Pakkwell Traders v. Cce",
    "224777": "Dalchand v. Municipal Corporation, Bhopal And Another",
    "1365277": "Bhavirisetti Deva Mohana Rao & Another v. State Of Andhra Pradesh .",
    "1220952": "E.V Kunhamu v. Food Inspector, Cannanore Municipality",
    "1866073": "State Of Himachal Pradesh v. Punnu Ram .",
    "620033": "State Of Himachal Pradesh v. Thakur Dass And Etc. Etc.",
    "1861080": "T.V Usman v. Food Inspector, Tellicherry Municipality, Tellicherry .",
    "179477870": "Dalmia Power Limited And Another v. Assistant Commissioner Of Income Tax Circle 1, Trichy .",
    "850428": "Commissioner Of Customs, Calcutta And Others v. Indian Oil Corpn. Ltd. And Another",
    "877414": "Kailash v. Nanhku And Others",
    "1940266": "Kunhayammed And Others v. State Of Kerala And Another",
    "150473": "R.N Jadi & Brothers And Others v. Subhashchandra .",
    "1988649": "Rani Kusum (Smt) v. Kanchan Devi (Smt) And Others",
    "1338327": "Shaikh Salim Haji Abdul Khayumsab v. Kumar And Others",
    "1001948": "Dhodha House v. S.K Maingi",
    "1905157": "Bishwanath Prasad Radhey Shyam v. Hindustan Metal Industries .",
    "1327080": "Dabur India Limited v. K.R Industries",
    "1156538": "Dhanpat Seth & Ors. v. M/S. Nil Kamal Plastic Crates Ltd.",
    "769926": "Dharampal Premchand Ltd. v. Golden Tobacco Products.",
    "474885": "Exphar Sa And Another v. Eupharma Laboratories Ltd. And Another",
    "176508424": "Foundry Visionmongers Ltd. v. Satyanarayana Reddy S.",
    "1682715": "Glaxo Smithkline Consumer Healthcare Gmbh & Co. Kg v. Anchor Health & Beautycare Private Limited",
    "51545606": "Indian Performing Right Society Ltd. v. Sanjay Dalia",
    "1876565": "Kurivalli Lingayya Setty v. Sitharam Agarwala And Another",
    "1132362": "Lok Nath Prasad Gupta. v. Bijay Kumar Gupta.",
    "1648254": "M/S. Intas Pharmaceuticals Ltd. v. Allergan Inc.",
    "100123": "M/S. Seemax Construction (P) Ltd. v. State Bank Of India And Another",
    "1700195": "Nedungadi Bank Ltd. v. Central Bank Of India Ltd.",
    "1674695": "Pfizer Products, Inc. v. Rajesh Chopra",
    "288525": "Sandeep Polymers (P) Ltd. v. Bajaj Auto Ltd. And Others",
    "1168060": "Seeranga Goundan v. Seeranga Goundan",
    "860600": "Wipro Limited, Sp-26... v. Oushadha Chandrika A...",
    "584977": "Dit (International Taxation), Mumbai v. Morgan Stanley & Co. Inc. .",
    "104810373": "Assistant Director Of Income Tax-I, New Delhi v. E-Funds It Solution Inc. .",
    "40753175": "Cit v. Ekl Appliances Ltd.",
    "183868316": "Commissioner Of Income Tax-I v. M/S. Cotton Naturals (I) Pvt. Ltd. S",
    "1996908": "Director Of Income Tax v. M/S. E Funds It Solution",
    "73767384": "Rampgreen Solutions Pvt. Ltd. v. Commissioner Of Income Tax",
    "1592558": "Entertainment Network (India) Ltd.and etc. v. Super Cassette Industries Ltd.and etc.",
    "317554": "Church Of North India v. Lavajibhai Ratanjibhai And Others",
    "605322": "Kancherla Narasimham v. Mahabubunnisa Begum",
    "1202878": "Management Of Hotel Imperial,New Delhi And Others v. Hotel Workers' Union",
    "54865315": "P. Krishnaveni v. The Collector District Magistrate, Kadapa Others",
    "108509106": "Perim Janardhana Rao v. Malepati Balaji And Ors",
    "1415114": "Phonographic Performance Ltd. & Ors v. Music Broadcast (P) Ltd. & Ors",
    "31239895": "PRAKASH KUMAR JHA v. STATE OF UTTARAKHAND",
    "21369704": "Excel Crop Care Limited v. Competition Commission Of India And Another",
    "864375": "Competition Commission Of India v. Steel Authority Of India Limited And Another",
    "309271": "Gokaraju Rangaraju v. State Of Andhra Pradesh .",
    "941137": "Harihar Prasad Dubey v. Tulsi Das Mundhra And Others",
    "88397": "Oxford University Press v. Commissioner Of Income Tax .",
    "1507797": "R. Rajagopal Reddy (Dead) By Lrs. And Others v. Padmini Chandrasekharan (Dead) By Lrs.",
    "911084": "Rajasthan Cylinders And Containers Limited (S); v. Union Of India (S).",
    "181654439": "Shivashakti Sugars Limited v. Shree Renuka Sugar Limited And Others",
    "686582": "Shri Balaganesan Metals v. M.N Shanmugham Chetty And Others",
    "1719469": "Technip Sa v. Sms Holding (P) Ltd. And Others",
    "913118": "Union Of India And Others v. Dharamendra Textile Processors And Others",
    "1462242": "Abdulla Bin Ali And Others v. Galappa And Others",
    "109700315": "Arun Agarwal v. Nagreeka Exports (P) Ltd. And Another",
    "85467018": "Bhau Ram v. Janak Singh And Others",
    "338115": "Indian Mineral & Chemicals Co. And Others v. Deutsche Bank .",
    "1147125": "Liverpool & London S.P & I Association Ltd. v. M.V Sea Success I And Another",
    "1903089": "Mayar (H.K) Ltd. And Others v. Owners & Parties, Vessel M.V Fortune Express And Others",
    "231341": "National Textile Corpn. Ltd. And Others v. Haribox Swalram And Others",
    "329158": "O.N Bhatnagar v. Smt Rukibai Narsindas And Others",
    "93127": "Oil And Natural Gas Commission v. Utpal Kumar Basu And Others",
    "1382657": "Om Prakash Srivastava v. Union Of India And Another",
    "175238601": "Pfizer Enterprises Sarl v. Cipla Ltd..",
    "442517": "Ramesh B. Desai And Others v. Bipin Vadilal Mehta And Others",
    "1947054": "Roop Lal Sathi v. Nachhattar Singh Gill .",
    "1596320": "Sonic Surgical v. National Insurance Company Limited .",
    "1102062": "Sree Mohan Chowdhury v. Chief Commissioner Union Territory Of Tripura .",
    "634266": "State Through Sp, New Delhi v. Ratan Lal Arora .",
    "1567797": "The Clan Line Steamers Ltd. v. Gordon Woodroffe And Co. (Madras) (Pte.) Ltd., And Others.",
    "1307808": "Union Of India And Others v. Adani Exports Ltd. And Another",
    "712415": "Godrej Sara Lee Limited v. Reckitt Benckiser Australia Pty. Limited And Another",
    "486081": "Alchemist Ltd. And Another v. State Bank Of Sikkim And Others",
    "1979794": "Ambica Industries v. Commissioner Of Central Excise .",
    "1166220": "Lt. Col. Khajoor Singh v. Union Of India & Another",
    "1695101": "Patel Roadways Limited, Bombay v. Prasad Trading Company .",
    "1916388": "Raj Kumar Shivhare v. Assistant Director, Directorate Of Enforcement And Another",
    "699319": "S.M.D Kiran Pasha v. Government Of Andhra Pradesh And Others",
    "37934": "Sumitomo Corporation v. Cdc Financial Services (Mauritius) Ltd. And Others",
    "191721813": "Google India Private Limited, ... vs The Deputy Commissioner Of Income ... on 11 May, 2018",
    "982330": "Commissioner Of Income-Tax v. Motorola India Ltd.",
    "861349": "Maram Subrahmanyam Stores By Proprietor Pullaya, Etc v. State Of Andhra Pradesh",
    "119316583": "SANDEEP KUMAR MISHRA v. DIRECTOR B.S.N.L. & ANOTHER",
    "1292463": "Mohinder Dutt Sharma v. Bhagat Ram and Anr.",
    "1584936": "Govt. Of A.P And Others v. Mohd. Nasrullah Khan .",
    "856194": "Apparel Export Promotion Council v. A.K Chopra .",
    "1508554": "B.C Chaturvedi v. Union Of India And Others",
    "1086058": "Canara Bank v. V.K Awasthy .",
    "899744": "Chairman And Managing Director, United Commercial Bank And Others v. P.C Kakkar .",
    "37987": "Filmistan Exhibitors Ltd. v. N.C.T, Delhi, Thr. Secy. Labour & Ors.",
    "227988": "Harbans Lal v. Jagmohan Saran .",
    "1750914": "Indian Overseas Bank v. I.O.B Staff Canteen Workers' Union And Another",
    "348173": "Lalit Popli v. Canara Bank And Others",
    "1246653": "Managing Director, Ecil, Hyderabad And Others v. B. Karunakar And Others",
    "1147963": "Municipal Corporation Of Delhi v. Asha Ram & Another",
    "180850491": "Nirmala J. Jhala v. State Of Gujarat And Another",
    "1798615": "R.S Saini v. State Of Punjab And Others",
    "630125": "Ram Narain Jha v. T.M Apartments Pvt. Ltd .",
    "1274327": "State Bank Of India And Others v. Ramesh Dinkar Punde .",
    "1763592": "State Of Andhra Pradesh And Others v. S. Sree Rama Rao .",
    "693281": "Sub-Divisional Officer, Konch v. Maharaj Singh .",
    "511928": "Syed Rahimuddin v. Director General, Csir And Others",
    "1611775": "Union Of India And Another v. Mustafa & Najibai Trading Co. And Others",
    "188429772": "Union Of India And Others v. Manab Kumar Guha .",
    "118501220": "Union Of India And Others v. P. Gunasekaran .",
    "707249": "Zora Singh v. Shri J.M Tandon And Others",
    "98622476": "Govt. Of Nct Of Delhi v. Jaspal Singh",
    "357132": "Baburao Bajirao Patil v. State Of Maharashtra .",
    "1589218": "Bishnu Prasad Sinha And Another v. State Of Assam .",
    "1718159": "C. Chenga Reddy And Others v. State Of A.P .",
    "1136663": "Esher Singh v. State Of A.P .",
    "94514": "Gulab Chand v. State Of M.P .",
    "206804": "Gurbax Singh v. State Of Haryana .",
    "1813445": "Manoranjan Singh v. State Of Delhi .",
    "204742": "Mohd. Khalid v. State Of W.B .",
    "309307": "R.V.E Venkatachala Gounder v. Arulmigu Viswesaraswami & V.P Temple And Another",
    "896874": "Rajesh Jagdamba Avasthi v. State Of Goa .",
    "23954109": "State (Nct Of Delhi) v. Navjot Sandhu Alias Afsan Guru",
    "585040": "State Of Goa v. Sanjay Thakran And Another",
    "557368": "State Of Maharashtra v. Damu",
    "220229": "V. C. Shukla v. State (Delhi Administration) .",
    "383397": "Gramophone Company Of India Ltd. v. Birendra Bahadur Pandey And Others",
    "165099707": "Adm, Jabalpur v. Shivakant Shukla",
    "1377335": "Anand Nivas Private Ltd. v. Anandji Kalyanji'S Pedhi And Others",
    "1963322": "Birendra Bahadur Pandey v. Gramophone Co. Of India Ltd. And Others",
    "102852": "M. Nagaraj And Others v. Union Of India And Others",
    "189907": "Messrs. V/O Tractoro Export, Moscow v. Messrs. Tarapore And Co. Madras And Another.",
    "104377": "Mirza Ali Akbar Kashani v. United Arab Republic And Another",
    "1318646": "N. Subramania Iyer v. Official Receiver, Quilon & Another",
    "58263027": "People'S Union For Civil Liberties (Pucl) v. Union Of India And Another",
    "685234": "Ram Krishna Dalmia v. Justice S.R. Tendolkar",
    "693363": "Bina Murlidhar Hemdev And Others v. Kanhaiyalal Lokram Hemdev And Others",
    "1722050": "Colgate Palmolive (India) Ltd. v. Hindustan Lever Ltd. .",
    "49480": "Dalpat Kumar And Another v. Prahlad Singh And Others",
    "1822024": "Dorab Cawasji Warden v. Coomi Sorab Warden And Others",
    "1313207": "Indian Oil Corporation Ltd. v. Amritsar Gas Service And Others",
    "1224686": "Mahadeo Savlaram Shelke And Others v. Pune Municipal Corporation And Another",
    "1120137": "Morgan Stanley Mutual Fund v. Kartick Das .",
    "452434": "Niranjan Shankar Golikari v. Century Spinning And Manufacturing Co. Ltd. .",
    "988645": "Percept D'Mark (India) (P) Ltd. v. Zaheer Khan And Another",
    "1186410": "Superintendence Company Of India (P) Ltd. v. Krishan Murgai .",
    "42294818": "Vijaya Minerals Pvt. Ltd. v. Bikash Chandra Deb",
    "528391": "Bade Miya v. Mubin Ahmed Zahurislam",
    "1597179": "Bhanwar Lal v. T.K.A Abdul Karim Through N.K Mohd. Mustafa .",
    "161147300": "Blueberry Books v. Bharti Goyal",
    "477313": "Central Inland Water Transport Corporation Limited And Another v. Brojo Nath Ganguly And Another",
    "279466": "Devdutta Dheer v. Janki Vallabh",
    "1019490": "Harihar Pandey v. Mangala Prasad Singh And Others",
    "793348": "Jagdish Chander Gupta v. Kajaria Traders (India) Ltd. .",
    "195994": "Kalloo (Smt) And Others v. Dhakadevi And Others",
    "421030": "Kamal Pushp Enterprises v. D.R Construction Co. .",
    "1022584": "Kerala Arecanut Stores v. M/S Ramkishore And Sons And Another",
    "1815080": "Maqbool Hussain v. State Of Bombay",
    "280485": "Mohammad Yasin And Another v. Mohammad Yasin And Others",
    "835500": "Mohan Lal v. Raghunath Singh .",
    "1239673": "Purushottam And Another v. Shivraj Fine Arts Litho Works And Others",
    "1586918": "R.S Nayak v. A.R Antulay .",
    "1664373": "Raptakos Brett & Co. Ltd. v. Ganesh Property",
    "1969682": "Samatha v. State Of A.P And Others",
    "1012649": "Seth Loonkaran Sethiya And Others v. Mr Ivan E. John And Others",
    "693891": "Shree Balaji Steels v. Gontermann-Peipers (India) Ltd.",
    "137050": "Shreeram Finance Corporation v. Yasin Khan And Others",
    "1024124": "Vasudev Dhanjibhai Modi v. Rajabhai Abdul Rehman And Others",
    "155579055": "Haldor Topsoe (I) Pvt Ltd, New ... vs Dcit, New Delhi on 26 December, 2018",
    "7003391": "Chryscapital Investment Advisors (India) Pvt. Ltd. v. Deputy Commissioner Of Income Tax",
    "67143323": "Ion Trading India Private Ltd. v. Ito",
    "175175391": "Sony Mobile Communications International v. Deputy Director Of Income Tax .",
    "41554823": "Omniglobe Informatio... v. ADDL. CIT, SPECIAL R...",
    "70037708": "Bechtel India Pvt. Ltd. v. Cit",
    "37721629": "Comverse Network Sys... v. Assistant Commissio...",
    "183120061": "Evalueserve.com Pvt. Ltd., New Delhi v. DCIT, New Delhi",
    "138217214": "Cadence Design Systems (India) Pvt. Ltd. () v. Deputy Commissioner Of Income Tax Circle 3(1) ().",
    "857323": "ST- Ericsson India Pvt. Ltd., New Delhi v. DCIT, New Delhi",
    "12050516": "Terex India Pvt. Ltd., Tamil Nadu v. DCIT, New Delhi",
    "591481": "Hamdard Dawakhana (Wakf),Delhi And Another. v. Union Of India And Others.",
    "1300072": "Deep Chand v. State Of U.P.",
    "1660833": "Kunnathat Thatehunni Moopil Nair, Etc v. State Of Kerala And Another",
    "1276331": "Narendra Kumar And Others v. Union Of India And Others .",
    "995861": "R.S Raghunath v. State Of Karnataka And Another",
    "1474119": "State Of Karnataka And Another v. Shri Ranganatha Reddy And Another",
    "1206754": "Imagic Creative (P) Ltd. v. Commissioner Of Commercial Taxes And Others",
    "795465": "20Th Century Finance Corpn. Ltd. And Another v. State Of Maharashtra .",
    "789627": "All-India Federation Of Tax Practitioners And Others v. Union Of India And Others",
    "280498": "Association Of Leasing And Financial Service Companies v. Union Of India And Others",
    "732612": "Builders' Association Of India And Others v. Union Of India And Others",
    "1341716": "Commissioner, Central Excise And Customs, Kerala v. Larsen And Toubro Limited .",
    "161939": "Gujarat Ambuja Cements Ltd. And Another v. Union Of India And Another",
    "1907642": "India Cement Ltd. And Others v. State Of Tamil Nadu And Others",
    "275246": "Kalawati Devi Harlalka v. Commissioner Of Income Tax, West Bengal And Others",
    "292286": "Lakshmi Audio Visual Inc., And Another v. Assistant Commissioner Of Commercial Taxes And Another",
    "155272316": "Larsen And Toubro Limited And Another v. State Of Karnataka And Another",
    "557776": "M/S Gannon Dunkerley And Co. And Others v. State Of Rajasthan And Others",
    "757639": "Rashtriya Ispat Nigam Ltd. v. Commercial Tax Officer, Company Circle, Visakhapatnam",
    "165968354": "Shri Nitin Ahuja, Director Of M/S. Ahuja Furnishers Pvt. Ltd. v. Cst, Delhi .",
    "1011356": "State Of A.P And Another v. Rashtriya Ispat Nigam Ltd. .",
    "833158": "State Of W.B And Others v. Purvi Communication (P) Ltd. And Others",
    "1290723": "T.N Kalyana Mandapam Assn. v. Union Of India And Others",
    "331232": "Indian Performing Right Society Ltd. v. Eastern Indian Motion Pictures Association And Others",
    "377266": "Eastern Book Company And Others v. D.B Modak And Another",
    "762055": "Eastern India Motion... v. Indian Performing Ri...",
    "85777093": "Indian Performing Right Society Ltd. v. Aditya Pandey & Ors. S",
    "1734007": "R.G Anand v. Delux Films And Others",
    "1271015": "Star India Private Limited v. Leo Burnett (India) Private Limited",
    "997135": "A.B.C Laminart (P) Ltd. And Another v. A.P Agencies, Salem .",
    "146267": "Ashwani Kumar Singh v. U.P Public Service Commission And Others",
    "907493": "Bhavesh D. Parish And Others v. Union Of India And Another",
    "623061": "Bhavnagar University v. Palitana Sugar Mill (P) Ltd. And Others",
    "71315": "Hasham Abbas Sayyad v. Usman Abbas Sayyad And Others",
    "1742704": "Kuldip Singh v. Subhash Chander Jain And Others",
    "68799740": "Manugraph India Limited v. Simarq Technologies Pvt. Ltd.",
    "69624144": "Ms. Eera Through Dr. Manjula Krippendorf (S) v. State (Govt. Of Nct Of Delhi) & Anr. (S)",
    "88087196": "Piruz Khambatta v. Rajmohan Rupaji Modi",
    "123737198": "Ultra Home Construction Pvt. Ltd. v. Purushottam Kumar Chaubey",
    "176039345": "Vishal N. Kalsaria v. Bank Of India And Others",
    "1548289": "Institute Of Chartered Accountants Of India v. Shaunak H. Satya And Others",
    "1186368": "Ajay Hasia And Others v. Khalid Mujib Sehravardi And Others",
    "133640019": "Alka Matoria v. Maharaja Ganga Singh University & Ors.",
    "165621647": "Arun Kumar Agrawal v. Union Of India And Others",
    "7926018": "Bharat Sanchar Nigam Ltd. v. Shri Chander Sekhar",
    "55517912": "Bihar Public Service Commission v. Saiyed Hussain Abbas Rizwi And Another",
    "1187886": "Bombay Stock Exchange Ltd (Bse) v. Security And Exchange Board Of India (Sebi) .",
    "1519371": "Central Board Of Secondary Education & Anr. v. Aditya Bandopadhyay & Ors. S",
    "101008236": "Central Board Of Secondary Education v. Anil Kumar Kathpal .",
    "160205361": "Girish Ramchandra Deshpande v. Central Information Commissionerand Others",
    "1261492": "Kumari Shrilekha Vidyarthi And Others v. State Of U.P And Others",
    "29023706": "Madhumohan & Ors. v. State Of Kerala & Ors.",
    "69052901": "Naresh Trehan Petitioner v. Rakesh Kumar Gupta",
    "681713": "P.N Duda v. P. Shiv Shanker And Others",
    "112896520": "Registrar Of Companies & Ors. v. Dharmendra Kumar Garg & Anr.",
    "86904342": "Reserve Bank Of India v. Jayantilal N. Mistry .",
    "1509628": "Sanjay Singh And Another v. U.P Public Service Commission, Allahabad And Another",
    "65293457": "Shail Sahni v. Sanjeev Kumar And Others",
    "1602162": "Som Prakash Rekhi v. Union Of India And Another",
    "837614": "U.P Public Service Commission v. Subhash Chandra Dixit And Others",
    "529229": "Y. Srinivasa Rao v. J. Veeraiah And Others",
    "103057287": "Isha Distribution House Pvt. Ltd. v. Aditya Birla Nuvo Ltd.",
    "111777378": "Excel Dealcomm Private Limited v. Asset Reconstruction Company (India) Limited And Others",
    "44641638": "Fast Flow Dealcom Pvt. Ltd. v. Grace Colonizers Pvt. Ltd.",
    "74910860": "Magma Fincorp Ltd. v. Ahk Earth Movers & Financial Services",
    "103434922": "Rooprekha Sales Pvt. Ltd. v. Navkar Buildwell Pvt. Ltd.",
    "16810704": "Sumer Builders Pvt. Ltd. v. Narendra Gorani",
    "27773000": "Sushil Kumar Agarwal v. Ajay Kumar Saraff And Another",
    "23402471": "The Oriental Insuran... v. M/S. Acme...",
    "733192": "Israil Sk. v. Distt. Magistrate Of West Dinajpur",
    "1596866": "Alijan Mian v. Distt. Magistrate",
    "1669803": "Anil Dey v. State Of West Bengal .",
    "1326449": "Attorney General For India And Others v. Amratlal Prajivandas And Others",
    "353578": "Debu Mahato v. State Of West Bengal .",
    "96706": "Dharua Kanu v. State Of West Bengal",
    "42299665": "Gautam Jain v. Union Of India And Another",
    "212274": "Kamarunnissa v. Union Of India And Another",
    "679149": "Khudiram Das v. State Of West Bengal And Others",
    "1923487": "Manoj Alias Ghantoori v. Union Of India And Others",
    "1038563": "Mohd. Salim Khan v. Shri C.C Bose And Another",
    "651705": "Mohd. Subrati Alias Mohd. Karim v. State Of West Bengal .",
    "310087": "Saraswathi Seshagiri (Mrs) v. State Of Kerala And Another",
    "633111": "Suru Mallick v. State Of West Bengal .",
    "890637": "Vijay Narain Singh v. State Of Bihar And Others",
    "249589": "Jonas Woodhead & Sons Ltd., Madras v. Commissioner Of Income Tax, Madras .",
    "612964": "Addl. Commissioner Of Income-Tax, New Delhi v. Shama Engine Valves Ltd.",
    "6547": "Agarwal Hardware Works (P.) Ltd. v. Commissioner Of Income-Tax, West Bengal-I.",
    "1805387": "Alembic Chemical Works Co. Ltd. v. Commissioner Of Income Tax, Gujarat .",
    "735457": "Bajaj Tempo Ltd. v. Commissioner Of Income-Tax.",
    "429924": "Ballimal Naval Kishore And Another v. Commissioner Of Income Tax, Bombay .",
    "188357431": "Cit v. Modi Revlon Pvt. Ltd.",
    "594383": "Commissioenr Of Income Tax, Bombay v. Ciba Of India Ltd. .",
    "1771122": "Commissioner Of Income Tax v. Lumax Industries Ltd.",
    "1030976": "Commissioner Of Income Tax v. M/S Asahi India Safety Glass Ltd.",
    "36875": "Commissioner Of Income Tax, Madras-Ii v. I.A.E.C (Pumps) Ltd., Madras",
    "980877": "Commissioner Of Income-Tax v. J.K Synthetics Limited",
    "491934": "Commissioner Of Income-Tax v. Lucas-T.V.S Limited (No. 1).",
    "1627481": "Commissioner Of Income-Tax, Bombay City-I v. Tata Engineering & Locomotive Co. Pvt. Ltd.",
    "1445734": "Commissioner Of Income-Tax, Delhi-Ii v. Bhai Sunder Dass & Sons P. Ltd.",
    "1278868": "Commissioner Of Income-Tax, Tamil Nadu-Ii v. Southern Switchgear Ltd.",
    "1671648": "Empire Jute Co. Ltd. v. Commissioner Of Income Tax .",
    "79561": "Jyoti Electric Motors Ltd. v. Commissioner Of Income-Tax.",
    "1022090": "Praga Tools Ltd. v. Commissioner Of Income-Tax, Hyderabad.",
    "1703545": "Scientific Engineering House (P) Ltd. v. Commissioner Of Income Tax, Andhra Pradesh .",
    "1163546": "Shriram Pistons & Rings Ltd v. Commissioner Of Income Tax, Delhi-Ii, New Delhi",
    "1033812": "Southern Switchgear Ltd. v. Cit",
    "652828": "Cadbury India Ltd. v. Neeraj Food Products",
    "27152913": "Consitex S.A. v. Kamini Jain",
    "89164": "Encore Electronics Ltd. v. Anchor Electronics & Electircals Pvt. Ltd.",
    "1470887": "M/S. Ansul Industries v. M/S. Shiva Tobacco Company",
    "508915": "Rupa & Co. Ltd. And Another v. Dawn Mills Co. Ltd. And Another",
    "48216667": "Shri Pankaj Goel v. Ms. Dabur India Ltd.",
    "904832": "Tata Iron & Steel Co. Ltd. v. Mahavir Steels",
    "1035346": "K.A Nagamani v. Indian Airlines And Others",
    "1297488": "Amlan Jyoti Borooah v. State Of Assam And Others",
    "634160": "Ashok Kumar Yadav And Others v. State Of Haryana And Others",
    "1999324": "Chandra Prakash Tiwari And Others v. Shakuntala Shukla And Others",
    "627069": "Dhananjay Malik And Others v. State Of Uttaranchal And Others",
    "1099140": "K. Shekar v. V. Indiramma And Others",
    "309541": "K.H Siraj v. High Court Of Kerala And Others",
    "1134429": "M.V Thimmaiah And Others v. Union Public Service Commission And Others",
    "175829": "Madan Lal And Others v. State Of J&K And Others",
    "54995969": "Madras Institute Of Development Studies And Another v. K. Sivasubramaniyan And Others",
    "3111930": "Manish Kumar Shahi v. State Of Bihar And Others",
    "261992": "Marripati Nagaraja And Others v. Government Of Andhra Pradesh And Others",
    "1129833": "Om Prakash Shukla v. Akhilesh Kumar Shukla And Others",
    "176122260": "Ramesh Chandra Shah And Others v. Anil Joshi And Others",
    "1115541": "Rashmi Mishra v. M.P Public Service Commission And Others",
    "816271": "Suraj Bhan Meena And Another v. State Of Rajasthan And Others",
    "264657": "Union Of India And Another v. N. Chandrasekharan And Others",
    "137734242": "Union Of India And Others v. N.R Banerjee And Others",
    "946842": "Union Of India And Others v. S. Vinodh Kumar And Others",
    "127517806": "K.S. Puttaswamy And Another v. Union Of India And Others",
    "63489929": "Ashoka Kumar Thakur v. Union Of India And Others",
    "94788795": "Binoy Viswam v. Union Of India And Others",
    "1014138": "Directorate Of Film Festivals And Others v. Gaurav Ashwin Jain And Others",
    "617044": "Directorate Of Revenue And Another v. Mohammed Nisar Holia",
    "1890740": "Dr Ram Krishan Bhardwaj Petition v. State Of Delhi And 2 Others",
    "146940961": "Ex-Armymen'S Protection Services Private Limited v. Union Of India And Others",
    "47808634": "M.P Oil Extraction And Another v. State Of M.P And Others",
    "1831036": "Mohindhr Singh Gill And Another v. Chief Election Commissioner, New Delhi And Others",
    "382721": "Mr X v. Hospital Z",
    "338008": "Selvi And Others v. State Of Karnataka",
    "115701246": "Shayara Bano v. Union Of India And O...",
    "110813550": "Shreya Singhal v. Union Of India",
    "850821": "State Of Maharashtra v. Prabhakar Pandurang Sanzgiri And Another",
    "80997184": "Subramanian Swamy v. Union Of India, Ministry Of Law And Others",
    "1981010": "Kaiser-I-Hind Pvt. Ltd. And Another v. National Textile Corpn. (Maharashtra North) Ltd. And Others",
    "453977": "Ashoka Marketing Ltd. And Another v. Punjab National Bank And Others",
    "893844": "Basantlal Banarsilal (Original Opponent), v. Bansilal Dagdulal (Original Petitioner), . \r",
    "1610804": "Consolidated Engineering Enterprises v. Principal Secretary, Irrigation Department And Others",
    "703764": "Hoechst Pharmaceuticals Ltd. And Others v. State Of Bihar And Others",
    "1103984": "Jawaharmal v. State Of Rajasthan And Others \r",
    "1716282": "M. Karunanidhi v. Union Of India And Another",
    "181033": "Minoo Framroze Balsara v. The Union Of India And Others \n",
    "1214980": "Rajiv Sarin And Another v. State Of Uttarakhand And Others",
    "681372": "State Of Jammu And Kashmir v. M.S Farooqi And Others",
    "199908142": "Suhas H. Pophale v. Oriental Insurance Company Limited And Its Estate Officer \r",
    "653417": "Bharat Bank Ltd., Delhi v. Employees Of The Bharat Bank Ltd., Delhi",
    "1405951": "Consolidated Engineering Enterprises v. Principal Secretary, Irrigation Department And Others",
    "96002": "F.M Devaru Ganapathi Bhat v. Prabhakar Ganapathi Bhat .",
    "122362": "Firm Ashok Traders And Another v. Gurumukh Das Saluja And Others",
    "162420": "H.M.P Engineers Ltd. And Others v. Ralies India Ltd. And Others",
    "39217891": "Haldiram Bhujiawala And Another v. Anand Kumar Deepak Kumar And Another",
    "1919561": "K.V George v. Secretary To Government, Water And Power Department, Trivandrum And Another",
    "1986966": "Laxmidas Dayabhai Kabrawala v. Nanabhai Chunilal Kabrawala And Others",
    "1426304": "Noida Toll Bridge Company Ltd v. Mitsui Marubeni Corporation .",
    "2671204": "P. Sarathy v. State Bank Of India .",
    "867423": "P.K Vijayan v. Kamalakshi Amma And Others",
    "1907957": "Patel Roadways Ltd. v. Birla Yamaha Ltd. .",
    "1641452": "S.B.P And Co. v. Patel Engineering Limited And Another",
    "1771880": "Sharad Vasant Kotak And Others v. Ramniklal Mohanlal Chawda And Another",
    "5114588": "Umesh Goel v. Himachal Pradesh Cooperative Group Housing Society Limited .",
    "57555980": "Krishika Lulla And Others v. Shyam Vithalrao Devkatta And Another",
    "565540": "Dr. Reckeweg Co. Gmbh. Another v. Adven Biotech Pvt. Ltd.",
    "67892682": "Lyca Productions v. J. Manimaran",
    "107853771": "Mattel, Inc. v. Jayant Agarwalla",
    "76636976": "Micolube India Limited v. Saurabh Industries",
    "102653512": "Navigators Logistics Ltd. v. Kashif Qureshi",
    "115718142": "R. Radha Krishnan v. A.R. Murugadoss",
    "565788": "Syndicate Of The Pre... v. B.D Bhandari & Anr. S",
    "585219": "Time Warner Entertainment Company I.P v. Rpg Netcom Ltd",
    "1110013": "Ajendraprasadji Narendraprasadji Pandey v. Swami K. Narayandasji And Others",
    "514933": "Allergan Inc. v. Milment Oftho Industries And Others",
    "33136745": "Allied Blenders Distillers P. Ltd. v. Paul P. John",
    "1006468": "Bal Pharma Ltd. v. Centaur Laboratories Pvt. Ltd. & Anr.",
    "769115": "Kalindi Medicure Pvt. Ltd. v. Intas Pharmaceuticals Ltd.",
    "507033": "Khoday Distilleries Limited v. The Scotch Whisky Association",
    "1319506": "Kirloskar Diesel Recon Pvt. Ltd. And Another v. Kirloskar Proprietary Ltd. And Others",
    "877389": "M/S Hindustan Sanitaryware & Industries Ltd. v. M/S Champion Ceramic",
    "179814250": "Palm Grove Beach Hotels Pvt. Ltd. v. Royal Palms (India) Pvt. Ltd.",
    "1677837": "Pannalal Binjraj And Another Etc., Etc. v. Union Of India And Others",
    "154833956": "Schering Corporation & Ors. v. Alkem Laboratories Ltd. .",
    "928322": "Ajay Aggarwal v. Union Of India And Others",
    "1326499": "Alamgir v. State (Nct, Delhi) .",
    "950361": "Devender Pal Singh v. State Of Nct Of Delhi And Another",
    "1891895": "Firozuddin Basheeruddin And Others v. State Of Kerala .",
    "410114": "Ganeshlal v. State Of Maharashtra .",
    "342903": "Major E.G Barsay v. State Of Bombay .",
    "620904": "Mohammad Usman Mohammad Hussain Maniyar And Others v. State Of Maharashtra .",
    "198827109": "N.G Dastane v. Shrikant S. Shivde And Another",
    "1611623": "Ram Narayan Popli v. Central Bureau Of Investigation .",
    "1515299": "Sidhartha Vashisht Alias Manu Sharma v. State (Nct Of Delhi) .",
    "923594": "State Of Gujarat v. Mohammed Atik And Others",
    "162432291": "State Of Maharashtra And Others v. Som Nath Thapa And Others",
    "1465670": "State Of U.P v. Shambhu Nath Singh And Others",
    "1378876": "Yash Pal Mittal v. State Of Punjab .",
    "116548206": "Monsanto Technology ... v. Nuziveedu Seeds Limi...",
    "66104323": "Akuate Internet Services Pvt. Ltd. &\nAnr. v. Star India Pvt. Ltd. & Anr. S",
    "52129591": "Claudio De Simone v. Actial Farmaceutica\nSrl.",
    "74061245": "Nuziveedu Seeds Ltd. v. Mahyco Monsanto Biotech (India) Pvt. Ltd",
    "83741552": "Pioneer Overseas Cor... v. Chairperson,\nProtect...",
    "181459283": "PRABHAT AGRI BIOTECH LTD. v. MAHYCO\nMONSANTO BIOTECH (INDIA) PVT. LTD.",
    "162878090": "PRAVARDHAN SEEDS PRIVATE LIMITED v.\nMAHYCO MONSANTO BIOTECH (INDIA) PVT. LTD.",
    "33194727": "Sungro Seeds Ltd. v. Dr. S.K. Tripathi ",
    "1335881": "Ms.Heinz Italia & Anr v. Ms.Dabur India Ltd",
    "271216": "Naranbhai Dayabhai Patel And Another v. Suleman Isubji Dadabhai",
    "1121229": "Gangwani And Co. v. Saraswati",
    "794450": "Hirabai Baburao Shidankar And Another v. Rayat Shikshan Sanstha, Satara And Others",
    "138184": "Hiragar Dayagar And Another v. Ratanlal Chunilal And Others",
    "816411": "Keki Pestonji Jamadar v. Rodabai Khodadad Merwan Irani",
    "1278222": "Keraba Dattu Borachate And Others v. Shri Sheshashai And Vishnu Trust .",
    "465681": "Maqbul Ahmed Miya Gi... v. Hidayatulla Baldi An...",
    "1572876": "Parvez Rustamji Bharda v. Navrojji Sorabji Tamboly And Others",
    "137238378": "R. Tanikaselvam v. K. Shanmugam",
    "634059": "R.C Chandiok And Another v. Chuni Lal Sabharwal And Others",
    "1672214": "Ramchandra Goverdhan Pandit v. Charity Commissioner Of State Of Gujarat .",
    "1961394": "Shivprasad Shankarla... v. Leelabai Badrinaraya...",
    "1965204": "Shri Govindrao Devab... v. Apparao Devabasappa ...",
    "165776436": "Novartis Ag v. Union Of India And Others",
    "183600564": "Bajaj Auto Ltd., State Of Maharashtra, Rep. By S. Ravikumar Petitioner v. Tvs Motor Company Limited",
    "57798471": "F. Hoffmann-La Roche Ltd. & Anr. v. Cipla Ltd..",
    "865758": "Farbwerke Hoechst Ak... v. Unichem Laboratories",
    "56087922": "Gujarat Urja Vikas Nigam Ltd. v. Essar Power Ltd. .",
    "91986422": "Merck Sharp And Dohme Corporation And Anr. v. Glenmark Pharmaceuticals",
    "64231867": "Rajesh Awasthi v. Nand Lal Jaiswal And Others",
    "1131957": "Smithkline Beecham Consumer Healthcare Gmbh v. G.D. Rathore",
    "306833": "State Of Madhya Pradesh And Another v. Dadabhoy'S New Chirimiri Ponri Hill Colliery Co. Pvt. Ltd. .",
    "576454": "Super Cassettes Industries Limited v. Chintamani Rao",
    "492853": "Surana Steels Pvt. Ltd. v. Dy. Commissioner Of Income Tax And Others",
    "109874394": "The Gramophone Company Of India Limited. v. Super Cassette Industries Ltd.",
    "152460": "Union Of India v. Steel Stock Holders Syndicate, Poona .",
    "1425094": "Yash Ahuja And Others v. Medical Council Of India And Others",
    "925897": "Olympus Superstructures Pvt. Ltd. v. Meena Vijay Khetan And Others",
    "899181": "Arosan Enterprises Ltd. v. Union Of India And Another",
    "31621011": "Associate Builders v. Delhi Development Authority .",
    "188958994": "Booz Allen And Hamilton Inc. v. Sbi Home Finance Limited And Others",
    "525017": "Champsey Bhara And Company v. Jivraj Balloo Spinning And Weaving Company Ltd.",
    "1500505": "Chloro Controls India Private Limited v. Severn Trent Water Purification Inc. And Others",
    "1483262": "Ispat Engineering & ... v. Steel Authority Of I...",
    "1056935": "J.G Engineers Private Limited v. Union Of India And Another",
    "1752565": "Konkan Railway Corpn. Ltd. And Others v. Mehul Construction Co. .",
    "1999671": "Konkan Railway Corporation Ltd. And Another v. Rani Construction Pvt. Ltd. .",
    "1738256": "Kwality Manufacturing Corporation v. Central Warehousing Corporation .",
    "588099": "M/S Sudarsan Trading Co. v. Government Of Kerala And Another",
    "135285745": "Mahanagar Telephone Nigam Limited v. Telephone Cables Ltd.",
    "996348": "Mcdermott International Inc. v. Burn Standard Co. Ltd. And Others",
    "317172": "N. Chellappan v. Secretary, Kerala State Electricity Board And Another",
    "919241": "Oil & Natural Gas Corporation Ltd. v. Saw Pipes Ltd. .",
    "73583860": "Rashtriya Ispat Nigam Limited v. Dewan Chand Ram Saran .",
    "455122": "Steel Authority Of India Limited v. Gupta Brother Steel Tubes Limited .",
    "1092394": "Sumitomo Heavy Industries Limited v. Oil And Natural Gas Corporation Limited .",
    "1604568": "Wellington Associates Ltd. v. Kirit Mehta .",
    "1209528": "P&B Pharmaceuticals (P) Ltd. v. Collector Of Central Excise .",
    "1307266": "Easland Combines, Coimbatore v. Collector Of Central Excise, Coimbatore .",
    "1442144": "Ece Industries Ltd. v. Commissioner Of Central Excise, New Delhi .",
    "774102": "Hyderabad Polymers (P) Ltd. v. Commissioner Of Central Excise, Hyderabad .",
    "1187885": "Mohan Meakins Ltd. v. Commissioner Of Central Excise, Kochi .",
    "1881313": "National Security Assurance Co. v. R. Ratilal & Co. .",
    "524871": "Nizam Sugar Factory v. Collector Of Central Excise, A.P .",
    "1212077": "Pahwa Chemicals Private Limited v. Commissioner Of Central Excise, Delhi .",
    "51689837": "Popat Bahiru Govardhane And Others v. Special Land Acquisition Officer And Another",
    "214713": "Raja Harish Chandra Raj Singh v. Deputy Land Acquisition Officer And Another",
    "1991497": "Royal Hatcheries Pvt. Ltd. And Others v. State Of A.P And Other",
    "511784": "S.S. Pharmaceutical P Ltd. v. Additional Collector, Central Excise",
    "379222": "State Of A.P And Another v. Marri Venkaiah And Others",
    "1771435": "Union Of India And Others v. Mangatu Ram And Others",
    "341560": "Panacea Biotech Limited v. Commissioner Of Customs, New Delhi .",
    "1856009": "Andhra Petrochemicals v. Collector Of Customs, Madras .",
    "687034": "Tata Iron & Steel Co. Ltd. v. Commissioner Of Central Excise & Customs, Bhubaneswar, Orissa",
    "1155640": "Patna Improvement Trust v. Shrimati Lakshmi Devi And Others",
    "1447296": "A.K Roy And Another v. State Of Punjab And Others",
    "1568935": "Aflatoon And Others v. Lt. Governor Of Delhi And Others",
    "1802196": "Babu Verghese And Others v. Bar Council Of Kerala And Others",
    "139670361": "Chandra Kishore Jha v. Mahavir Prasad And Others",
    "1831078": "Commissioner Of Income Tax, Mumbai v. Anjum M.H Ghaswala And Others",
    "794815": "Deep Chand v. State Of Rajasthan .",
    "501542": "Delhi Administration v. Gurdip Singh Uban And Others",
    "30319311": "Dhanajaya Reddy v. State Of Karnataka .",
    "350628": "J.N Ganatra v. Morvi Municipality, Morvi .",
    "866760": "Nika Ram v. State Of Himachal Pradesh .",
    "354829": "Prabha Shankar Dubey v. State Of M.P .",
    "1104087": "Ram Phal Kundu v. Kamal Sharma .",
    "1986616": "Ramchandra Keshav Adke (Dead) By Lrs And Others v. Govind Joti Chavare And Others",
    "1727525": "State Of Bihar And Another v. J.A.C Saldanha And Others",
    "68469": "State Of Mizoram v. Biakchhawna .",
    "1989264": "State Of T.N And Others v. L. Krishnan And Others",
    "407511": "State Of Uttar Pradesh v. Singhara Sinh And Others",
    "1136885": "Grindlays Bank Ltd. v. Central Government Industrial Tribunal And Others",
    "736105": "Income Tax Officer, Cannanore. v. M. K. Mohammed Kunhi",
    "5192": "Manohar Lal Chopra v. Rai Bahadur Rao Raja Seth Hiralal",
    "1242789": "Music Choice India Pvt. Ltd. v. Phonographic Performance Ltd.",
    "1836621": "Sakiri Vasu v. State Of Uttar Pradesh And Others",
    "1439704": "Associated Electronic & Electrical Industries (Bangalore) Private Ltd. v. Sharp Tools",
    "1052178": "Bindeshwari Prasad Singh v. Kali Singh .",
    "130087": "Burlington Home Shopping Pvt Ltd. v. Rajnish Chibber & Anr.",
    "800341": "C. Cunniah And Co., ... v. Balraj And Co., By P...",
    "138192511": "Chancellor Masters v. Narendera Publishing House",
    "1195618": "Devendra Somabhai Naik v. Accurate Transheat Pvt. Ltd. .",
    "977497": "Eastern Book Co. v. Navin J. Desai",
    "396205": "Ferro Alloys Corpn. Ltd. And Another v. Union Of India And Others",
    "1440160": "King Features Syndicate Inc. & Ors. v. Sunil Agnihotri & Ors.",
    "1194654": "M/S. Mishra Bandhu Karyalaya And Others v. Shivratanlal Koshal",
    "710165": "Mahendra Chandra (Nath) Ghosh v. The Emperor Opposite Party.",
    "1763149": "Mahendra Radio And Television v. State Bank Of India",
    "1754074": "R. Madhavan v. S.K Nayar .",
    "625240": "Twentieth Century Fox Film Corporation v. Sohail Maklai Entertainment Pvt. Ltd.",
    "582634": "Urmi Juvekar Chiang v. Global Broadcast News Ltd.",
    "603848": "Zee Telefilms Ltd. v. Sundial Communications Pvt. Ltd. And Others",
    "148082701": "Radio Today Broadcasting Ltd vs Indian Performing Rights Society ... on 26 September, 200",
    "1887773": "Indian Performing Rights Society Ltd. v. Branch Manager, Muthoot Finance Pvt. Ltd. &Ors.",
    "85089691": "UNIVERSAL MUSIC(INDIA) PVT.LTD v. TRIMURTI FILMS PVT.LTD AND 6 ORS",
    "258508": "Raja Jagannath Baksh Singh v. State Of Uttar Pradesh And Anr",
    "1180216": "Assistant Commissioner Of Urban Land Tax And Others v. Buckingham And Carnatic Co. Ltd., Etc. .",
    "403501": "Automobile Transport... v. State Of Rajasthan A...",
    "328927": "Balaji v. Income Tax Officer, Special Investigation Circle, Akola And Others",
    "1404351": "Chhotabhai Jethabhai Patel & Co. v. Union Of India",
    "494408": "East India Tobacco Company Etc. v. State Of Andhra Pradesh And Another (In Both The Appeals) .",
    "1723469": "Grasim Industries Ltd. v. Collector Of Customs, Bombay .",
    "1048632": "Khandige Sham Bhat And Ors. v. The Agricultural Income Tax Officer",
    "668225": "Khyerbari Tea Co. Ltd. And Another v. State Of Assam And Others",
    "314044": "R.K Garg v. Union Of India And Others",
    "1216757": "Rai Ramkrishna And Others Etc. v. State Of Bihar (In Both The Appeals) .",
    "80498353": "Ram Baksh Singh Petitioner v. State Of U.P And Others S",
    "919121": "Sri Ram Ram Narain Medhi v. State Of Bombay",
    "1213194": "State Of Andhra Pradesh And Another Etc v. Nalla Raja Reddy And Others, Etc. S,",
    "380655": "State Of Jharkhand And Others v. Voltas Ltd., East Singhbhum .",
    "1877462": "V. Padmanabha Ravi Varma Raja And Others v. The Deputy Tahsiidar Chittur And Others",
    "1397964": "Rajinder Kumar Aggarwal v. Union Of India & Anr.",
    "81086651": "Ashok Kumar Aggarwal And Ors. v. Rajinder Kumar Aggarwal & Ors.",
    "1847057": "Adhunik Steels Ltd. v. Orissa Manganese And Minerals (P) Ltd. .",
    "82620": "Atlas Cycles (Haryana) Ltd. v. Atlas Products Pvt. Ltd. .",
    "1578200": "Delta International Ltd. v. Shyam Sundar Ganeriwalla And Another",
    "3173546": "Nandhini Deluxe v. Karnataka Cooperative Milk Producers Federation Limited .",
    "124137051": "Pidilite Industries Limited v. Jubilant Agri & Consumer Products Limited",
    "762747": "Provash Chandra Dalui And Another v. Biswanath Banerjee And Another",
    "1247926": "Registrar Of Trade Marks v. Ashok Chandra Rakhit Ltd. .",
    "1062099": "Relx India Private L... v. D.B Modak And Spectr...",
    "47391891": "Ajitsinh Arjunsinh Gohil v. Bar Council Of Gujarat And Another",
    "108020655": "All India Power Engineer Federation And Others v. Sasan Power Limited And Others",
    "1416283": "D.S Nakara And Others v. Union Of India",
    "81824666": "Golla Rajanna And Others v. Divisional Manager And Another",
    "81716407": "Hdfc Securities Limited And Others v. State Of Maharashtra And Another",
    "194456776": "Idbi Trusteeship Services Limited v. Hubtown Limited",
    "166780307": "Mobilox Innovations Private Limited v. Kirusa Software Private Limited",
    "1685319": "P.U Joshi And Others v. Accountant General, Ahmedabad And Others",
    "179794777": "Secretary, State Of Karnataka And Others v. Umadevi (3) And Others",
    "1330629": "State Of Haryana And Others v. Charanjit Singh And Others",
    "1640744": "State Of Orissa And Another v. Mamata Mohanty",
    "374340": "State Of Punjab And Others v. Jagjit Singh And Others",
    "38764718": "S.D. Containers Indore v. Mold Tek Packaging Ltd.",
    "17789938": "Essdee Industries v. Esbee Eectrotech Llp .",
    "70487596": "J.C. Bamford Excavators Limited v. Bull Machines Pvt. Ltd.",
    "6137338": "M/S. Tele World Marketing v. The Joint Commissioner (Drugs), Food & Drugs Administration & Others",
    "14898186": "Wallmax India Enterprises Private Limited v. The Deputy Controller Of Patents & Designs & Anr.",
    "138826371": "Westin Sankalp Developers v. Ajay Sikandar Rana",
    "1706612": "Girnar Food & Beverages Pvt. Ltd. v. Godfrey Phillips India Ltd. .",
    "135809": "Jai Prakash Khadria v. Shyam Sunder Agarwalla And Another",
    "1677896": "Kala Niketan v. Kala Niketan",
    "873775": "Kedar Nath Gupta v. J.K Organisation .",
    "1333219": "London Rubber Co. Ltd. v. Durex Products Incorporated And Another",
    "1132299": "Nestle'S Products Limited & Another v. M/S. Milkmade Corporation And Another S",
    "241970": "Shridevi And Another v. Muralidhar And Another",
    "1850663": "Uniply Industries Ltd. v. Unicorn Plywood Pvt. Ltd. And Others",
    "1362442": "Desh Bandhu Gupta v. N.L Anand & Rajinder Singh",
    "584252": "Fateh Chand v. Balkishan Dass .",
    "1938230": "Hamza Haji v. State Of Kerala And Another",
    "1877641": "Satish Khosla v. Eli Lilly Ranbaxy Ltd.",
    "1403823": "Surasaibalini Debi (Smt) v. Phanindra Mohan Majumdar .",
    "60799": "S.R Bommai And Others v. Union Of India And Others",
    "1844910": "A.K Kaul And Another v. Union Of India And Another",
    "499867": "B.R Kapur v. State Of T.N And Another",
    "37494799": "Dr. M. Ismail Faruqui And Others v. Union Of India And Others",
    "1363234": "Indra Sawhney And Others v. Union Of India And Others",
    "509065": "Ms Aruna Roy And Others v. Union Of India And Others",
    "1180101": "R.K Jain v. Union Of India",
    "647343": "Raja Ram Pal v. Hon'Ble Speaker, Lok Sabha And Others",
    "79280249": "Rameshwar Prasad And Others (Vi) v. Union Of India And Another",
    "1382698": "Samsher Singh v. State Of Punjab And Another",
    "514077": "State Of Karnataka v. Appa Balu Ingale And Others",
    "174974": "State Of Rajasthan v. Union Of India",
    "753224": "Supreme Court Advocates-On-Record Association And Others v. Union Of India",
    "1023674": "T. Venkata Reddy And Others v. State Of Andhra Pradesh",
    "512761": "T.M.A Pai Foundation And Others v. State Of Karnataka And Others",
    "1900118": "Union Of India And Another v. Balbir Singh And Another",
    "1732840": "Sales Tax Officer And Another v. Shree Durga Oil Mills And Another",
    "1543623": "A.P. Pollution Control Board Ii v. Prof. M.V. Nayudu Retd. And Ors.",
    "1890994": "Bannari Amman Sugars Ltd. v. Commercial Tax Officer And Others",
    "540642": "Dharampal Satyapal Ltd. v. Union Of India",
    "425153": "Dr. Ashok Kumar Maheshwari v. State Of U.P And Another",
    "600280": "General Officer Commanding-In-Chief And Another v. Dr Subhash Chandra Yadav And Another",
    "98342524": "Kasinka Trading And Another v. Union Of India And Another",
    "1486949": "M.C Mehta v. Union Of India And Others",
    "985842": "Mahabir Vegetable Oils (P) Ltd. And Another v. State Of Haryana And Others",
    "871220": "Motilal Padampat Sugar Mills Co. Ltd. v. State Of Uttar Pradesh And Others",
    "1233850": "Mrf Ltd., Kottayam v. Asstt. Commissioner (Assessment) Sales Tax And Others",
    "1741949": "Pawan Alloys & Casting Pvt. Ltd., Meerut v. U.P State Electricity Board And Others",
    "1877956": "Pournami Oil Mills And Others v. State Of Kerala And Another",
    "139299795": "Sharma Transport v. Govt. Of A.P.",
    "1872329": "Shrijee Sales Corporation And Another v. Union Of India .",
    "347224": "State Of Bihar And Others v. Suprabhat Steel Ltd. And Others",
    "994554": "State Of Punjab v. Nestle India Ltd. And Another",
    "476474": "State Of Rajasthan And Another v. J.K Udaipur Udyog Ltd. And Another",
    "1151918": "State Of Rajasthan And Another v. Mahaveer Oil Industries And Others",
    "290385": "Superintendent, Govt. T.B Sanatorium And Another v. J. Srinivasan .",
    "53080": "Union Of India And Others v. Godfrey Philips India Ltd. .",
    "1882267": "Union Of India And Others v. Indo-Afghan Agencies Ltd.",
    "223504": "Indian Express Newspapers (Bombay) Private Ltd. And Others v. Union Of India And Others",
    "161614515": "Shinhan Apex Corporation v. Euro Apex B.V. .",
    "849254": "Andhra Co-Operative ... v. Regional Provident F...",
    "743158": "Bikash Bhushan Ghosh And Others v. Novartis India Ltd. And Another",
    "1695291": "Global Energy Limited And Another v. Central Electricity Regulatory Commission .",
    "323576": "Interglobe Aviation Limited v. N. Satchidanand . \r",
    "1304475": "Kranti Associates Private Limited And Another v. Masood Ahmed Khan And Others \n",
    "1152518": "L. Chandra Kumar v. Union Of India And Others \r",
    "673012": "Smt. Ujjam Bai v. State Of Uttar Pradesh",
    "761967": "Basheshar Nath. v. Commissioner Of Income Tax Delhi & Rajasthan And Another.",
    "1300646": "Calcutta Discount Co. Ltd. v. Ito",
    "414792": "Daryao And Others v. State Of U.P And Others",
    "1643138": "Naresh Shridhar Mirajkar And Others v. State Of Maharashtra And Another .",
    "471272": "Pradeep Kumar Biswas v. Indian Institute Of Chemical Biology And Others",
    "350976": "Special Director And Another v. Mohd. Ghulam Ghouse And Another",
    "1959866": "T.C Basappa v. T. Nagappa And Another",
    "468834": "Asharfi Lal v. Koili (Smt) Dead By Lrs.",
    "1659850": "Ganpatbhai Mahijibhai Solanki v. State Of Gujarat And Others",
    "1878548": "Regional Manager, Central Bank Of India v. Madhulika Guruprasad Dahir And Others",
    "422732": "State Of A.P v. Nagoti Venkataramana .",
    "1899039": "Penguin Books Ltd. v. India Book Distributors",
    "1149874": "Reserve Bank Of India v. Peerless General Finance And Investment Co. Ltd. And Others",
    "155329262": "State Of Andhra Pradesh Through Principal Secretary And Others v. Pratap Karan And Others",
    "62991042": "Budh Ram And Others v. Bansi And Others",
    "120358": "C. Golak Nath And Others v. State Of Punjab And Another",
    "861510": "Central Bureau Of Investigation And Others v. Keshub Mahindra And Others",
    "1354608": "Harihar Prasad Singh And Others v. Balmiki Prasad Singh And Others",
    "912526": "Lanka Venkateswarlu (D) By Lrs. v. State Of A.P & Ors S",
    "306336": "N. Jayaram Reddy And Another v. Revenue Divisional Officer And Land Acquisition Officer, Kurnool .",
    "166007515": "Pankajakshi (Dead) Through Legal Representatives And Others v. Chandrika And Others",
    "268937": "Sardar Amarjit Singh... v. Pramod Gupta (Smt) (...",
    "1668065": "Shalini Shyam Shetty And Another v. Rajendra Shankar Patil .",
    "1338837": "State Of Gujarat v. Vora Salebhai Gulamali And Others",
    "246887": "Afsar Sheikh And Another v. Soleman Bibi And Others",
    "843614": "B. Banerjee v. Anita Pan (Smt)",
    "170697": "Bachhaj Nahar v. Nilima Mandal And Another",
    "1567371": "Balai Chandra Hazra . v. Shewdhari Jadav .",
    "1594031": "Board Of Revenue And Others v. A.M Ansari And Others",
    "256224": "Ranganayakamma And Another v. K.S Prakash (Dead) By Lrs. And Others",
    "963790": "Shrimati Shantabai v. State Of Bombay And Others",
    "1403309": "State Of Orissa And Others v. Vijay Laxmi Oil Industries .",
    "896743": "State Of Punjab And Others v. Shakti Cotton Company",
    "36937": "Babu Ram Jagdish Kumar And Co. v. State Of Punjab And Others",
    "883586": "Vallabh Das v. Dr Madan Lal And Other",
    "1487019": "Gill & Co. (P) Ltd. v. Commercial Tax Officer & Others",
    "160991": "Govind Saran Ganga Saran v. Commissioner Of Sales Tax And Others",
    "213382": "Patel Cotton Company Private Ltd. v. The State Of Punjab And Others",
    "1564015": "Rattan Lal & Co. And Another Etc. v. Assessing Authority, Patiala And Another Etc.",
    "1663733": "State Of Punjab And Others v. Chandu Lal Kishori Lal And Others",
    "1593570": "State Of Punjab And Others v. M/S Subhash Trading Company. .",
    "293197": "State Of Tamil Nadu v. M/S Pyare Lal Malhotra And Others",
    "315432": "State Of Punjab v. K. R. Erry And Sobhag Rai Mehta",
    "639803": "A.K Kraipak And Others v. Union Of India And Others",
    "1885635": "Baikuntha Nath Das v. District Medical Officer",
    "290962": "Board Of High School And Intermediate Education, U.P, Allahabad v. Ghanshyam Das Gupta And Others",
    "1566": "Deokinandan Prasad v. State Of Bihar And Others",
    "485924": "Dfo, South Kheri And Others v. Ram Sanehi Singh .",
    "743328": "Erusian Equipment & Chemicals Ltd. v. State Of West Bengal And Another",
    "1550190": "Keshav Mills Co. Ltd. And Another v. Union Of India And Others",
    "344644": "M. Narasimhachar v. State Of Mysore .",
    "1920837": "State Of Kerala And Others v. M. Padmanabhan Nair .",
    "1867924": "State Of Maharashtra v. M.H Mazumdar .",
    "296025": "State Of Punjab And Another v. Iqbal Singh .",
    "281850": "State Of W.B v. Haresh C. Banerjee And Others",
    "1869228": "State Of West Bengal & Ors. v. R.C Banerjee",
    "869781": "State Of Tripura v. Province Of East Bengal Union Of India",
    "1536230": "Kamala Mills Ltd. v. State Of Bombay",
    "1199558": "Kasturi Lal Ralia Ram Jain v. State Of Uttar Pradesh",
    "1954356": "Province Of Bombay v. Kusaldas S. Advani And Others",
    "332955": "Raleigh Investment Co. Ltd v. Governor-General In Council",
    "1411268": "Secretary Of State v. Mask And Co",
    "119540048": "Super Cassettes Industries Limited v. Music Broadcast Private Limited",
    "1521460": "Amruta Babaji Mozar v. Kondabai Babaji Mozar And Another",
    "135953": "Duncans Industries Ltd. v. State Of U.P And Others",
    "899938": "Jagdish Mandal v. State Of Orissa And Others",
    "1616148": "M/S Star Enterprises... v. City And Industrial ...",
    "118046405": "M/S. Moraliya Brothers v. Jaipur Vidyut Vitran Nigam Limited And Another",
    "50089303": "Maa Binda Express Carrier And Another v. North-East Frontier Railway And Others",
    "187501619": "Michigan Rubber (India) Limited v. State Of Karnataka And Others",
    "1576587": "Mrf, Ltd., Goa. v. Goa Mrf Employees Union, Goa, And Another",
    "794955": "P.H.Kalyani v. Air France, Calcutta .",
    "483734": "Pottery Mazdoor Panchayat v. Perfect Pottery Co. Ltd. And Another",
    "952082": "Raunaq International Ltd. v. I.V.R Construction Ltd. And Others",
    "20356733": "Saj Enterprises v. Municipal Corporation Of Greater Bombay And Another",
    "130353321": "Tejas Constructions And Infrastructure Private Limited v. Municipal Council, Sendhwa And Another",
    "86762634": "Vedica Procon Private Limited v. Balleshwar Greens Private Limited And Others",
    "1180206": "Surender Kumar Aggarwal v. Satyapal Varshneya",
    "1159790": "K. Ramachandra Reddy And Another v. Public Prosecutor",
    "1743339": "Khedu Mohton And Others v. State Of Bihar",
    "1120373": "Khujji Surendra Tiwari v. State Of Madhya Pradesh .",
    "1484358": "Matadin And Others v. State Of U.P .",
    "1505859": "Sharad Birdhi Chand Sarda v. State Of Maharashtra",
    "1381953": "Soma Bhai v. State Of Gujarat .",
    "1453719": "State Of Haryana v. Sher Singh And Others",
    "659090": "State Of Maharashtra v. Narsingrao Gangaram Pimple",
    "1296255": "Virsa Singh v. State Of Punjab .",
    "858492": "T.V Venugopal v. Ushodaya Enterprises Limited And Another",
    "1655935": "Blue Hill Logistics Private Ltd. v. Ashok Leyland Limited",
    "446828": "Essel Packaging Limited v. Essel Tea Exports Ltd.",
    "1104701": "Honda Motors Co. Ltd. v. Charanjit Singh",
    "40533940": "Mohd. Mehtab Khan And Others v. Khushnuma Ibrahim Khan And Others",
    "143202244": "TOFAN SINGH v. THE STATE OF TAMIL NADU",
    "832781": "Balkishan A. Devidayal v. State Of Maharashtra",
    "1013766": "Directorate Of Enforcement v. Deepak Mahajan And Another",
    "1599972": "K.I Pavunny v. Assistant Collector (Hq), Central Excise Collectorate, Cochin",
    "1097490": "Raj Kumar Karwal v. Union Of India And Others",
    "1355660": "Ramesh Chandra Mehta v. State Of West Bengal",
    "1438183": "State Of Punjab v. Baldev Singh",
    "191907197": "Wockhardt Limited v. Torrent Pharmaceuticals Limited And Another",
    "1509899": "Astrazeneca Uk Ltd. v. Orchid Chemicals & Pharmaceuticals Ltd.",
    "1025815": "S.M Dyechem Ltd. v. Cadbury (India) Ltd. .",
    "1945028": "Veerumal Praveen Kumar v. Needle Industries (India) Ltd. And Anr.",
    "850381": "N.R Dongre And Others v. Whirlpool Corporation And Another",
    "67204010": "Mahendra & Mahendra Paper Mills Ltd. v. Mahindra & Mahindra Ltd. .",
    "81162651": "Purshottam Vishandas Raheja And Another v. Shrichand Vishandas Raheja (Dead) Through Lrs. And Others",
    "1269197": "Fedders North American v. Show Line",
    "70200400": "Ramesh Khatanmal Lulla v. Mohammad Yusuf Abdul Gaffar",
    "645115": "Peshawar Soap & Chemicals Ltd. v. Godrej Soap Ltd.",
    "94612663": "United Biotech Pvt. Ltd. v. Orchid Chemicals & Pharmaceuticals Ltd. & Ors.",
    "1965135": "Torrent Pharmaceuticals Ltd. v. The Wellcome Foundation Ltd. .",
    "192230665": "Euro-Solo Energy Systems Limited v. Eveready Industries India Limited",
    "106681665": "Vishwa Mitter Of Vijay Bharat Cigarette Stores, Dalhousie Road, Pathankot v. O.P Poddar And Others",
    "1502681": "A. R. Antulay v. Ramdas Sriniwas Nayak And Another",
    "618763": "Iqbal Singh Marwah And Another v. Meenakshi Marwah And Another",
    "3304039": "Manharibhai Muljibhai Kakadia And Another v. Shaileshbhai Mohanbhai Patel And Others",
    "304538": "S.K Sinha, Chief Enforcement Officer v. Videocon International Ltd. And Others",
    "340501": "Shri M.L Sethi v. Shri R.P Kapur And Another",
    "98291024": "Indra Kumar Patodia And Another v. Reliance Industries Limited And Others",
    "117903": "Kamlapati Trivedi v. State Of West Bengal .",
    "646292": "Madhu Limaye v. State Of Maharashtra .",
    "700020": "Marc Enterprises (P) Ltd. v. Five Star Electricals (India)",
    "1864885": "Vrajlal Manilal & Co. v. Bansal Tobacco Co.",
    "78472331": "Lt Foods Limited v. Sulson Overseas Pvt. Ltd.",
    "1202388": "P.M. Diesels Private Limited v. Thukral Mechanical Works",
    "52700318": "A.D. Padmasingh v. Aachi Aappakadai Chettinad",
    "1238420": "Three-N-Products Pvt. Ltd. v. Yashwant",
    "60866758": "Mex Switchgears Pvt. Ltd. v. Max Switchgears Pvt. Ltd.",
    "614155": "Borosil Glass Works v. O.P Batra & Anr.",
    "139585580": "Triumphant Institute Of Management Education Pvt. Ltd. v. Mahesh Yadav",
    "73989": "Infosys Technologies Ltd. v. Park Infosys",
    "6896400": "Keshav Kumar Aggarwal v. Niit Ltd.",
    "136111": "Hawkins Cookers Ltd. v. Murugan Enterprises",
    "181424088": "Brahmos Aerospace Pvt. Ltd. v. Fiit Jee Limited",
    "179972913": "L'Oreal v. Dushyant Shah",
    "1300598": "Ranbaxy Laboratories Limited v. Intas Pharmaceuticals Ltd.",
    "170719338": "M/S INTER IKEA SYSTEMS BV ANR v. IMTIAZ AHAMED & ANR",
    "14349": "Commissioner Of Sales Tax v. M/S Duke And Sons Pvt. Ltd.",
    "691314": "S.P.S Jayam And Co. v. Registrar, Tamil Nadu Taxation Special Tribunal And Others",
    "1062207": "Agromore (P) Ltd. v. Chembond Chemicals Ltd.",
    "1118022": "Sunrise Associates v. Govt. Of Nct Of Delhi And Others",
    "13352": "Balaji Constructions Co., Mumbai & Ors. v. Mrs. Lira Siraj Shaikh & Ors.",
    "1789265": "Anand Kumar Deepak Kumar Another v. Haldiram Bhujia Wala Another",
    "147470112": "Kirorimal Kashiram Marketing And Agencies Pvt. Ltd. v. Shree Sita Chawal Udyog",
    "1306228": "Colgate Palmolive Company v. Anchor Health And Beauty Care Pvt. Ltd.",
    "152715128": "M/S Kirorimal Kashiram Marketing & Agencies Pvt. Ltd. v. M/S. Shree Sita Chawal Udyog Mill",
    "42490190": "General Mills Marketing Inc v. South India Beverages (P) Ltd.",
    "767356": "N. Ranga Rao v. Anil Garg",
    "1900841": "Filex Systems Pvt. Ltd. v. Rotomac Pens (Guj.) Pvt. Ltd.",
    "19504407": "Marico Limited v. Mukesh Kumar",
    "1640143": "Petitioner v. Respondent",
    "1557873": "Merisant Company 2 Sarl v. Equal Minerals",
    "8433581": "Premier Tissues India Ltd. v. Rolia Tissues Industries",
    "1657978": "Rajnish Aggarwal v. Anantam",
    "788484": "Toyota Jidosha Kabushiki Kaisha v. Deepak Mangal",
    "18135822": "Clinique Laboratories Llc v. Gufic Limited",
    "49386818": "Radico Khaitan Limited v. Carlsberg India Private Limited",
    "1741869": "Yahoo, Inc. v. Akash Arora",
    "321682": "Sanat Products Ltd. v. Glade Drugs & Nutraceuticals Pvt. Ltd.",
    "1165153": "Izuk Chemical Works v. Babu Ram Dharam Prakash",
    "1784548": "Aravind Laboratories v. V. Annamalai Chettiar",
    "744316": "Remidex Pharma Private Limited v. Savita Pharmaceuticals P. Ltd",
    "357841": "Wyeth Holdings Corporation & Anr. v. Burnet Pharmaceuticals (Pvt.) Ltd.",
    "1004544": "Fdc Limited v. Mr. Ajay G. Piramal & Ors",
    "157791679": "Sun Pharma Laboratories Ltd. v. Intas Pharmaceuticals Limited",
    "102042281": "Stiefel Laboratories v. Ajanta Pharma Ltd.",
    "663392": "Glaxo Group Ltd. And Another v. Neon Laboratories Ltd.",
    "27816811": "Radico Khaitan Limited v. Brima Sagar Maharashtra Distilleries Ltd.",
    "1857898": "L.T. Overseas Ltd. v. Guruji Trading Co.",
    "1375229": "Hero Honda Motors Ltd. v. Assuramji Scooters",
    "8022081": "Hero Honda Motors Limited v. Rafiq Memon",
    "1611564": "Marc Enterprises Pvt. Ltd. v. Victor Industries",
    "125686531": "Nirog Pharma Pvt. Ltd. v. Umesh Gupta",
    "1983225": "Indian Performing Right Society Ltd. v. Debashis Patnaik",
    "141920684": "Haldiram Bhujiawala & Anr. v. Anand Kumar Deepak Kumar & Ors.",
    "374690": "Radhika Agro Industries Pvt. Ltd. v. Paawan Agro Foods Ltd",
    "1460395": "Bimal Govindji Shah Trading As Acme Industries v. Panna Lal Chandu Lal",
    "1981161": "Rakesh Kumar Aggarwal v. Lock & Locking Devices",
    "1281453": "Visakha Chemicals v. Mala Ram & Sons",
    "145549327": "Cadila Healthcare Ltd. v. Aureate Healthcare Pvt. Ltd.",
    "112995556": "Eaton Corporation v. Bch Electric Limited"
}